NordicPlayground/nRF51-ble-bcast-mesh/timeslot_handler.c
#include "timeslot_handler.h"

#include "radio_control.h"
#include "trickle.h"
#include "trickle_common.h"
#include "drip_control.h"

#include "nrf_sdm.h"
#include "app_error.h"
#include "nrf_assert.h"
#include "nrf_delay.h"
#include "nrf_gpio.h"
#include "nrf_soc.h"
#include "boards.h"
#include "simple_uart.h"
#include <stdbool.h>
#include <stdint.h>
#include <string.h>
#include <stdio.h>

#define PACKET_ADV_ADDR_INDEX       (3)
#define PACKET_LENGTH_INDEX         (1)
#define PACKET_TYPE_INDEX           (0)
#define PACKET_ADV_DATA_INDEX       (9)
#define PACKET_MAN_DATA_INDEX       (13)

#define PACKET_TYPE                 (0x02)

#define PACKET_ADV_DATA_MAN_TYPE    (0xFF)
#define PACKET_ADV_DATA_MAN_COMPANY (0x0059) /* Nordic Semiconductor identifier */

#define PACKET_PROPAGATION_TIME_US  (104)
#define PACKET_PRECOMP_TIME_US      (70)
#define PACKET_SAFETY_MARGIN_US     (80)
#define PACKET_RAMP_UP_TIME_US      (140)

/*****************************************************************************
* Local type definitions
*****************************************************************************/

typedef enum
{
    TRICKLE_RADIO_MODE_SEARCHING,
    TRICKLE_RADIO_MODE_CALIBRATING,
    TRICKLE_RADIO_MODE_PERIODIC
} trickle_radio_mode_t;


/*****************************************************************************
* Static globals
*****************************************************************************/

/**
* Timeslot request structures
*/
static nrf_radio_request_t radio_request_normal = 
                {
                    .request_type = NRF_RADIO_REQ_TYPE_NORMAL,
                    .params.normal = 
                    {
                        .hfclk = NRF_RADIO_HFCLK_CFG_DEFAULT,
                        .priority = NRF_RADIO_PRIORITY_NORMAL,
                        .distance_us = TRICKLE_INTERVAL_US,
                        .length_us = TRICKLE_TIMESLOT_LENGTH_US
                    }
                };
                
static nrf_radio_request_t radio_request_earliest = 
                {
                    .request_type = NRF_RADIO_REQ_TYPE_EARLIEST,
                    .params.earliest = 
                    {
                        .hfclk = NRF_RADIO_HFCLK_CFG_DEFAULT,
                        .priority = NRF_RADIO_PRIORITY_NORMAL,
                        .length_us = TRICKLE_TIMESLOT_LENGTH_US,
                        .timeout_us = 1000000 /* 1s */
                    }
                };
                        
                
/**
* Timeslot callback return parameters
*/
static const nrf_radio_signal_callback_return_param_t radio_signal_cb_ret_param_none =
                {
                    .callback_action = NRF_RADIO_SIGNAL_CALLBACK_ACTION_NONE
                };
                
static nrf_radio_signal_callback_return_param_t radio_signal_cb_ret_param_request =
                {
                    .callback_action = NRF_RADIO_SIGNAL_CALLBACK_ACTION_REQUEST_AND_END,
                    .params.request.p_next = (nrf_radio_request_t*) &radio_request_normal
                };
                
static const nrf_radio_signal_callback_return_param_t radio_signal_cb_ret_param_extend =
                {
                    .callback_action = NRF_RADIO_SIGNAL_CALLBACK_ACTION_EXTEND,
                    .params.extend.length_us = 900000 /* 0.9 seconds */
                };

                
          
static trickle_radio_mode_t g_trickle_radio_mode;
                
                
/**
* Flag to end the timeslot as soon as possible
*/                
static bool end_timeslot = false;  
static bool extend_timeslot = false;          
static uint32_t interval_counter;              
static int32_t clock_drift;                

static uint16_t parent;
                
static drip_t* sync_drip;                
                
static uint8_t tx_buffer[40];
/*****************************************************************************
* Static Functions
*****************************************************************************/

/**
* Causes the unit to enter scan mode, where it will try to sync up with an 
* existing network
*
* Puts the radio in RX mode and stays there, either until a packet is received
* or until the search timeout is triggered. Enables a PPI from address match to 
* timer capture, in order to capture the RX time as precisely as possible.
* When the radio receives a valid packet, it enters periodic mode, which is the 
* main operation mode. This is done by ordering a timeslot at 10ms (minus setup and
* propagation time) from the beginning of the packet reception. 
*/
static void enter_search_mode(void)
{
    radio_request_earliest.params.earliest.length_us = 100000; /* 100ms */
    sd_radio_request((nrf_radio_request_t*) &radio_request_earliest);
    g_trickle_radio_mode = TRICKLE_RADIO_MODE_SEARCHING;
}

/**
* Called when the searching timeslot has been granted. Sets up radio, timer and PPI
*/
static void search_mode_timeslot_started(void)
{
    /* Setup timeout timer */
    NRF_TIMER0->CC[0] = 90000;
    NRF_TIMER0->CC[1] = 0;
    NRF_TIMER0->EVENTS_COMPARE[0] = 0;
    NRF_TIMER0->INTENSET = TIMER_INTENSET_COMPARE0_Msk;
    NVIC_EnableIRQ(TIMER0_IRQn);
    
    /* Setup PPI */
    NRF_PPI->CH[TRICKLE_SEARCHING_TIMEOUT_PPI_CH].EEP   = (uint32_t) &(NRF_RADIO->EVENTS_ADDRESS);
	NRF_PPI->CH[TRICKLE_SEARCHING_TIMEOUT_PPI_CH].TEP   = (uint32_t) &(NRF_TIMER0->TASKS_CAPTURE[1]);
	NRF_PPI->CHENSET 			                        |= (1 << TRICKLE_SEARCHING_TIMEOUT_PPI_CH);
}

static void tx_buffer_init()
{
    memset(tx_buffer, 0, 40);
    tx_buffer[PACKET_TYPE_INDEX] = PACKET_TYPE;
    
    uint64_t addr = (((uint64_t) NRF_FICR->DEVICEADDR[0] << 32) | NRF_FICR->DEVICEADDR[1]);
    uint8_t address[6];
    for (uint8_t i = 0; i < 6; ++i)
    {
        address[i] = (addr >> i * 8) & 0xFF;
    }
    memcpy(&tx_buffer[PACKET_ADV_ADDR_INDEX], address, 6);
    
    tx_buffer[PACKET_ADV_DATA_INDEX + 1] = PACKET_ADV_DATA_MAN_TYPE;
    tx_buffer[PACKET_ADV_DATA_INDEX + 2] = (PACKET_ADV_DATA_MAN_COMPANY & 0xFF);
    tx_buffer[PACKET_ADV_DATA_INDEX + 3] = (PACKET_ADV_DATA_MAN_COMPANY >> 8);
}

/*****************************************************************************
* System callback functions
*****************************************************************************/

/**
* Callback telling us that the designated "sync" drip has been updated 
*/
void sync_drip_rx(droplet_t* latest_droplet)
{
    TICK_PIN(PIN_RX);
    switch (g_trickle_radio_mode)
    {
        case TRICKLE_RADIO_MODE_CALIBRATING:
        
