NordicPlayground/nRF51-ble-bcast-mesh/timeslot_handler.c
            if (true || latest_droplet->last_sender == parent)
            {
                uint32_t timestamp = NRF_TIMER0->CC[1];
                uint32_t step_count = latest_droplet->data[0];
                clock_drift = (PACKET_PROPAGATION_TIME_US - timestamp - step_count) / step_count;          
                //PIN_OUT(step_count, 32);
            }
            
            end_timeslot = true;
            
            
            
            break;
        case TRICKLE_RADIO_MODE_PERIODIC:
            if (latest_droplet->version <= sync_drip->droplet.version)
            {
                trickle_timer_reset(&(sync_drip->trickle));
                sync_drip->droplet.length = 1;
                //sync_drip->trickle.t = trickle_timestamp_get();
                ++sync_drip->droplet.version;
                PIN_OUT((sync_drip->trickle.t), 32);
                
                uint32_t ts = trickle_timestamp_get();
                PIN_OUT((ts), 32);
                //PIN_OUT(0xAC, 8);
            }
            break;
        case TRICKLE_RADIO_MODE_SEARCHING:
            break;
    }
}



/**
* Callback for data reception. Called from radio_event_handler in radio_control.c
* upon packet reception. Called in LowerStack interrupt priority (from radio_signal_callback)
* Propagates relevant packets to user space
*/
void radio_rx_callback(uint8_t* rx_data)
{    
    if (g_trickle_radio_mode != TRICKLE_RADIO_MODE_CALIBRATING)
        end_timeslot = true;
    
    /* packet verification */
    uint32_t faulty_packet = 0;
    
    faulty_packet |= (NRF_RADIO->CRCSTATUS == 0);
    faulty_packet |= (rx_data[PACKET_TYPE_INDEX] != PACKET_TYPE);
    faulty_packet |= (rx_data[PACKET_ADV_DATA_INDEX + 1] != PACKET_ADV_DATA_MAN_TYPE);
    
    if (faulty_packet)
    {
        TICK_PIN(PIN_ABORTED);
        return;
    }
    
     
    /* Synchronization stuff */
    uint32_t timestamp = NRF_TIMER0->CC[1];       
    
    if (rx_data[PACKET_ADV_ADDR_INDEX + 5] < tx_buffer[PACKET_ADV_ADDR_INDEX + 5] || true)
    {
        clock_drift = 0;
        radio_request_normal.params.normal.distance_us = 
            TRICKLE_INTERVAL_US - (PACKET_PROPAGATION_TIME_US - timestamp) - clock_drift;
        
        //PIN_OUT((PACKET_PROPAGATION_TIME_US - timestamp), 32);
    }
    
    /* send to above layer */
    packet_t packet;
    packet.data = &rx_data[PACKET_MAN_DATA_INDEX];
    packet.length = rx_data[PACKET_ADV_DATA_INDEX];
    packet.sender = (rx_data[PACKET_ADV_ADDR_INDEX + 4] << 8) |
                    (rx_data[PACKET_ADV_ADDR_INDEX + 5] & 0xFF);
    
    drip_packet_dissect(&packet);
    
    
    if (g_trickle_radio_mode == TRICKLE_RADIO_MODE_SEARCHING)
    {
        memcpy(&tx_buffer[PACKET_ADV_ADDR_INDEX], &rx_data[PACKET_ADV_ADDR_INDEX], 4);
        parent = packet.sender;
        
        /* one receive means that we are ready to enter calibration mode */
        g_trickle_radio_mode = TRICKLE_RADIO_MODE_CALIBRATING;
        //g_trickle_radio_mode = TRICKLE_RADIO_MODE_PERIODIC;
    }
}

/**
* Callback for TX completion. After a successful TX, the timeslot should end.
*/
void radio_tx_callback(void)
{
    TICK_PIN(PIN_TRICKLE_TX);
    
    end_timeslot = true;
}


void sd_assert_handler(uint32_t pc, uint16_t line_num, const uint8_t* p_file_name)
{
    SET_PIN(PIN_ABORTED);
    while (true)
    {
        nrf_delay_ms(500);
        SET_PIN(LED_0);
        CLEAR_PIN(LED_1);
        nrf_delay_ms(500);
        SET_PIN(LED_1);
        CLEAR_PIN(LED_0);
    }
}

void app_error_handler(uint32_t error_code, uint32_t line_num, const uint8_t * p_file_name)
{

    SET_PIN(PIN_ABORTED);
    while (true)
    {
        PIN_OUT(error_code, 32);
        nrf_delay_ms(500);
        SET_PIN(LED_0);
        CLEAR_PIN(LED_1);
        nrf_delay_ms(500);
        SET_PIN(LED_1);
        CLEAR_PIN(LED_0);
    }
}

/**
* Timeslot related events callback
* Called whenever the softdevice tries to change the original course of actions 
* related to the timeslots
*/
void SD_EVT_IRQHandler(void)
{
    uint32_t evt;
    
    while (sd_evt_get(&evt) == NRF_SUCCESS)
    {
        PIN_OUT(evt, 32);
        switch (evt)
        {
            case NRF_EVT_RADIO_SESSION_IDLE:
                
                APP_ERROR_CHECK(NRF_ERROR_INVALID_DATA);
                break;
            
            case NRF_EVT_RADIO_SESSION_CLOSED:
                APP_ERROR_CHECK(NRF_ERROR_INVALID_DATA);
                
                break;
            
            case NRF_EVT_RADIO_BLOCKED:
                radio_request_normal.params.normal.distance_us += TRICKLE_INTERVAL_US; /* skip a period */
                sd_radio_request(&radio_request_normal);
                
                break;
            
            case NRF_EVT_RADIO_SIGNAL_CALLBACK_INVALID_RETURN:
                APP_ERROR_CHECK(NRF_ERROR_INVALID_DATA);
                break;
            
            case NRF_EVT_RADIO_CANCELED:
                if (g_trickle_radio_mode == TRICKLE_RADIO_MODE_SEARCHING)
                {
                    /* timeslot ran out for search mode, enter periodic. */
                    DEBUG_PIN_TH(PIN_CONSISTENT);
                    CLEAR_PIN(PIN_SEARCHING);
                    
                    sd_radio_request(&radio_request_earliest);
                    g_trickle_radio_mode = TRICKLE_RADIO_MODE_PERIODIC;
                }
                //APP_ERROR_CHECK(NRF_ERROR_INVALID_DATA);
                break;
            default:
                APP_ERROR_CHECK(NRF_ERROR_INVALID_STATE);
        }
    }
}


/**
* Radio signal callback handler taking care of all signals in searching mode
*/
static nrf_radio_signal_callback_return_param_t* radio_signal_callback_searching(uint8_t sig)
{
    /* If the trickle step is not finished, the default action is to continue the timeslot */
    nrf_radio_signal_callback_return_param_t* ret_param = (nrf_radio_signal_callback_return_param_t*) &radio_signal_cb_ret_param_none;
    
    switch (sig)
    {
        case NRF_RADIO_CALLBACK_SIGNAL_TYPE_START:
            end_timeslot = false;
            /* timeslot start, init radio module */
            radio_init(radio_rx_callback, radio_tx_callback);
            search_mode_timeslot_started();
            SET_PIN(PIN_SEARCHING);
            /* send radio into continuous rx mode */
            radio_rx(0);
        
            /* ask to extend the timeslot immediately, as we will need more than the given 100ms */
            ret_param = (nrf_radio_signal_callback_return_param_t*) &radio_signal_cb_ret_param_extend;
        
            break;
        
        case NRF_RADIO_CALLBACK_SIGNAL_TYPE_RADIO:
            /* send to radio control module */
            //DEBUG_PIN_TH(PIN_RADIO_SIGNAL);
            radio_event_handler();
            break;
        
        case NRF_RADIO_CALLBACK_SIGNAL_TYPE_TIMER0:
            /* give up timer, start periodic */
            DEBUG_PIN_TH(PIN_CONSISTENT);
        
            if (NRF_TIMER0->EVENTS_COMPARE[0])
            {
                radio_disable();
                radio_signal_cb_ret_param_request.params.request.p_next = 
                    (nrf_radio_request_t*) &radio_request_earliest;
                ret_param = &radio_signal_cb_ret_param_request;
                NRF_TIMER0->TASKS_STOP = 1;
                g_trickle_radio_mode = TRICKLE_RADIO_MODE_PERIODIC;
                CLEAR_PIN(PIN_SEARCHING);
            }
            break;
            
