NordicPlayground/nRF51-ble-bcast-mesh/timeslot_handler.c
        case NRF_RADIO_CALLBACK_SIGNAL_TYPE_EXTEND_SUCCEEDED:
            /* Extend the abort timer to the new timeslot length, which is 1 second */
            NRF_TIMER0->CC[0] = 999000; /* 999ms, leaving 1 ms for clean up */
            break;
        
        case NRF_RADIO_CALLBACK_SIGNAL_TYPE_EXTEND_FAILED:
            DEBUG_PIN_TH(PIN_ABORTED);
            break;
        
        default:
            APP_ERROR_CHECK(NRF_ERROR_INVALID_STATE);
    }
    
    /* end the timeslot right away, and order the next timeslot in a periodic fashion */
    if (end_timeslot)
    {
        radio_request_normal.params.normal.distance_us = 
                    TRICKLE_INTERVAL_US - TRICKLE_RX_PROPAGATION_US 
                    + NRF_TIMER0->CC[1] - 40 - TRICKLE_SAFETY_MARGIN_US; /* 40 = address bits RX time */
        radio_request_normal.params.normal.length_us = TRICKLE_TIMESLOT_LENGTH_US;
        radio_request_normal.params.normal.hfclk = NRF_RADIO_HFCLK_CFG_DEFAULT;
        radio_request_normal.params.normal.priority = NRF_RADIO_PRIORITY_NORMAL;
        radio_request_normal.request_type = NRF_RADIO_REQ_TYPE_NORMAL;
        
        radio_signal_cb_ret_param_request.params.request.p_next = &radio_request_normal;
        ret_param = &radio_signal_cb_ret_param_request;
        
        if (g_trickle_radio_mode == TRICKLE_RADIO_MODE_SEARCHING)
            g_trickle_radio_mode = TRICKLE_RADIO_MODE_PERIODIC;
        
        CLEAR_PIN(PIN_SEARCHING);
    }
    
    return ret_param;
}

/**
* Radio signal callback handler taking care of all signals in periodic mode
*/
static nrf_radio_signal_callback_return_param_t* radio_signal_callback_calibrating(uint8_t sig)
{
    SET_PIN(2);
    static bool calibration_request_sent = false;
    nrf_radio_signal_callback_return_param_t* ret_param = 
        (nrf_radio_signal_callback_return_param_t*) &radio_signal_cb_ret_param_none;
    switch (sig)
    {
        case NRF_RADIO_CALLBACK_SIGNAL_TYPE_START:
            radio_init(radio_rx_callback, radio_tx_callback);
            end_timeslot = false;
            if (calibration_request_sent)
            {
                radio_rx(0);
            }
            else
            {
                DEBUG_PIN_TH(PIN_SYNC_TIME);
                trickle_time_increment();
                trickle_timer_reset(&sync_drip->trickle);
                sync_drip->trickle.t = 0;
                
                bool anything_to_send = false;
                packet_t packet;
                packet.data = &tx_buffer[PACKET_MAN_DATA_INDEX];
                drip_packet_assemble(&packet, DROPLET_MAX_PACKET_LENGTH, &anything_to_send);
                
                if (!anything_to_send)
                {
                    APP_ERROR_CHECK(NRF_ERROR_INTERNAL);
                }
                
                tx_buffer[PACKET_LENGTH_INDEX] = 11 + packet.length;
                tx_buffer[PACKET_ADV_DATA_INDEX] = 4 + packet.length;
                radio_tx(tx_buffer);
                
                NRF_TIMER0->CC[1] = PACKET_PRECOMP_TIME_US + PACKET_SAFETY_MARGIN_US + PACKET_RAMP_UP_TIME_US;
                NRF_TIMER0->EVENTS_COMPARE[0] = 0;
                
                
                /* Set up a PPI for packet timing. Used to sync with other devices */
                NRF_PPI->CH[TRICKLE_SYNC_PPI_CH].EEP   = (uint32_t) &(NRF_TIMER0->EVENTS_COMPARE[1]);
                NRF_PPI->CH[TRICKLE_SYNC_PPI_CH].TEP   = (uint32_t) &(NRF_RADIO->TASKS_START);
                NRF_PPI->CHENSET 			                        |= (1 << TRICKLE_SYNC_PPI_CH);
                
            }
            
            break;
        
        case NRF_RADIO_CALLBACK_SIGNAL_TYPE_RADIO:
            /* send to radio control module */
            radio_event_handler();
            break;
        
        case NRF_RADIO_CALLBACK_SIGNAL_TYPE_TIMER0:
            break;
            
        default:
            APP_ERROR_CHECK(NRF_ERROR_INVALID_STATE);
    }
        
    /* a flag to end the timeslot has been set, end and order next. */
    if (end_timeslot)
    {
        if (!calibration_request_sent)
        {
            radio_request_normal.params.normal.distance_us = TRICKLE_INTERVAL_US * 4;
            radio_request_normal.params.normal.length_us = TRICKLE_INTERVAL_US * 6;
            calibration_request_sent = true;
        }
        else 
        {
            radio_request_normal.params.normal.distance_us = TRICKLE_INTERVAL_US;
            radio_request_normal.params.normal.length_us = TRICKLE_TIMESLOT_LENGTH_US;
            CLEAR_PIN(2);
        }
        radio_request_normal.request_type = NRF_RADIO_REQ_TYPE_NORMAL;
        radio_signal_cb_ret_param_request.params.request.p_next = &radio_request_normal;
        
        ret_param = &radio_signal_cb_ret_param_request;    
    }
    
    return ret_param;
    
}

/**
* Radio signal callback handler taking care of all signals in periodic mode
*/
static nrf_radio_signal_callback_return_param_t* radio_signal_callback_periodic(uint8_t sig)
{
    /* If the trickle step is not finished, the default action is to continue the timeslot */
    nrf_radio_signal_callback_return_param_t* ret_param = 
        (nrf_radio_signal_callback_return_param_t*) &radio_signal_cb_ret_param_none;
    
    switch (sig)
    {
        case NRF_RADIO_CALLBACK_SIGNAL_TYPE_START:
        {
            ++interval_counter;
            /* reset interval timer */
            radio_request_normal.params.normal.distance_us = TRICKLE_INTERVAL_US - clock_drift;
    
            trickle_time_increment();
            end_timeslot = false;
            /* timeslot start, init radio module */
            radio_init(radio_rx_callback, radio_tx_callback);
        
            DEBUG_PIN_TH(PIN_SYNC_TIME);

            bool anything_to_send = false;
            packet_t packet;
            packet.data = &tx_buffer[PACKET_MAN_DATA_INDEX];
            drip_packet_assemble(&packet, DROPLET_MAX_PACKET_LENGTH, &anything_to_send);
            
            
            
            if (anything_to_send)
            {
                tx_buffer[PACKET_LENGTH_INDEX] = 11 + packet.length;
                tx_buffer[PACKET_ADV_DATA_INDEX] = 4 + packet.length;
                radio_tx(tx_buffer);
                
                NRF_TIMER0->CC[1] = PACKET_PRECOMP_TIME_US + PACKET_SAFETY_MARGIN_US + PACKET_RAMP_UP_TIME_US;
                NRF_TIMER0->EVENTS_COMPARE[0] = 0;
                
                
                /* Set up a PPI for packet timing. Used to sync with other devices */
                NRF_PPI->CH[TRICKLE_SYNC_PPI_CH].EEP   = (uint32_t) &(NRF_TIMER0->EVENTS_COMPARE[1]);
                NRF_PPI->CH[TRICKLE_SYNC_PPI_CH].TEP   = (uint32_t) &(NRF_RADIO->TASKS_START);
                NRF_PPI->CHENSET 			                        |= (1 << TRICKLE_SYNC_PPI_CH);
                
