NordicPlayground/nRF51-ble-bcast-mesh/timeslot_handler.c
            }
            else
            {
                /* No tx this step, go into rx mode */
                radio_rx(1);
                
                /* prepare a timeout in order to abort the rx when it doesn't receive anything */
                
                NRF_TIMER0->CC[0] = 900; /* 0.9ms, the timeslot is 1ms, need some time to clean up */
                NRF_TIMER0->CC[1] = 0;
                NRF_TIMER0->EVENTS_COMPARE[0] = 0;
                NRF_TIMER0->INTENSET = TIMER_INTENSET_COMPARE0_Msk;
                NVIC_EnableIRQ(TIMER0_IRQn);
                
                
                /* Set up a PPI for packet timing. Used to sync with other devices */
                NRF_PPI->CH[TRICKLE_SYNC_PPI_CH].EEP   = (uint32_t) &(NRF_RADIO->EVENTS_ADDRESS);
                NRF_PPI->CH[TRICKLE_SYNC_PPI_CH].TEP   = (uint32_t) &(NRF_TIMER0->TASKS_CAPTURE[1]);
                NRF_PPI->CHENSET 			                        |= (1 << TRICKLE_SYNC_PPI_CH);
                
                
            }
        }
            break;
        
        case NRF_RADIO_CALLBACK_SIGNAL_TYPE_RADIO:
            /* send to radio control module */
            radio_event_handler();
            break;
        
        case NRF_RADIO_CALLBACK_SIGNAL_TYPE_TIMER0:
            /* The only timer in periodic mode is to stop RX. */
            if (NRF_TIMER0->EVENTS_COMPARE[0])
            {
                NRF_TIMER0->EVENTS_COMPARE[0];
                radio_disable();
                
                end_timeslot = true;
            }
            break;
            
        default:
            APP_ERROR_CHECK(NRF_ERROR_INVALID_STATE);
    }
        
    /* a flag to end the timeslot has been set, end and order next. */
    if (end_timeslot)
    {
        //radio_request_normal.params.normal.distance_us = TRICKLE_INTERVAL_US;
        radio_request_normal.request_type = NRF_RADIO_REQ_TYPE_NORMAL;
        radio_signal_cb_ret_param_request.params.request.p_next = &radio_request_normal;
        
        ret_param = &radio_signal_cb_ret_param_request;    
    }
    
    if (extend_timeslot)
    {
        
    }
    
    return ret_param;
}


/**
* Callback function for radio signals in time slot. Delegates signal based on state
*/
static nrf_radio_signal_callback_return_param_t* radio_signal_callback(uint8_t sig)
{
    //SET_PIN(PIN_CPU_IN_USE);
    nrf_radio_signal_callback_return_param_t* ret_param = (nrf_radio_signal_callback_return_param_t*) &radio_signal_cb_ret_param_none;
    //DEBUG_PIN_TH(PIN_RADIO_SIGNAL);
    
    if (sig == NRF_RADIO_CALLBACK_SIGNAL_TYPE_START)
    {
        SET_PIN(PIN_IN_TIMESLOT);
    }
    
    switch (g_trickle_radio_mode)
    {
        case TRICKLE_RADIO_MODE_SEARCHING:
            ret_param = radio_signal_callback_searching(sig);
            break;
        
        case TRICKLE_RADIO_MODE_PERIODIC:
            ret_param = radio_signal_callback_periodic(sig);
            break;
        
        case TRICKLE_RADIO_MODE_CALIBRATING:
            ret_param = radio_signal_callback_calibrating(sig);
            break;
    }
    if (ret_param->callback_action == NRF_RADIO_SIGNAL_CALLBACK_ACTION_REQUEST_AND_END)
    {
        CLEAR_PIN(PIN_IN_TIMESLOT);
    }
        
    
    PIN_OUT(sig, 8);
    
    //CLEAR_PIN(PIN_CPU_IN_USE);
    return ret_param;
}

/*****************************************************************************
* Interface Functions
*****************************************************************************/

void timeslot_handler_init(void)
{
    uint32_t error;
    
    error = sd_softdevice_enable((uint32_t)NRF_CLOCK_LFCLKSRC_XTAL_250_PPM, sd_assert_handler);
    APP_ERROR_CHECK(error); 
    
    error = sd_nvic_EnableIRQ(SD_EVT_IRQn);
    APP_ERROR_CHECK(error);
    
    sd_radio_session_open(&radio_signal_callback);
    
    tx_buffer_init();
    
    interval_counter = 0;
    clock_drift = 0;
    
    /* allocate one drip that will be used for various network sync */
    sync_drip = drip_allocate_new();
    sync_drip->identifier.broadcast.id = 0;
    sync_drip->flags |= (1 << DRIP_FLAG_IS_BROADCAST_POS) |
                        (1 << DRIP_FLAG_VOLATILE_POS) |
                        (1 << DRIP_FLAG_SYSTEM_POS) |
                        (1 << DRIP_FLAG_ACTIVE_POS);
    //sync_drip->droplet.length = 1;
    //sync_drip->droplet.data[0] = 0xFF;
    //sync_drip->droplet.version = 0;
    
    
    
    enter_search_mode();
}

void timeslot_handler_start_periodic(uint32_t time_period_us)
{
    if (time_period_us == 0)
    {
        APP_ERROR_CHECK(sd_radio_request((nrf_radio_request_t*) &radio_request_earliest));
    }
    else
    {
        radio_request_normal.params.normal.distance_us = time_period_us;
        APP_ERROR_CHECK(sd_radio_request(&radio_request_normal));
    }
    
    g_trickle_radio_mode = TRICKLE_RADIO_MODE_PERIODIC;
}

